ndom91/pinevoice-realtime-firmware/components/chip_bl606p/drivers/soc_std/bsp/std_drv/src/bl606p_sflash.c
        SF_Ctrl_SendCmd(&flashCmd);

        /* Adjust address and programmed length */
        addr += curLen;
        i += curLen;
        data += curLen;

        /* Wait for write done */
        cnt = 0;

        while (SET == SFlash_Busy(pFlashCfg)) {
            arch_delay_us(100);
            cnt++;

            if (cnt > pFlashCfg->timePagePgm * 20) {
                return ERROR;
            }
        }
    }

    if (secOptMode > 0) {
        if (((uint32_t)(uintptr_t)&flashCmd) % 4 == 0) {
            arch_memset4((uint32_t *)&flashCmd, 0, sizeof(flashCmd) / 4);
        } else {
            arch_memset(&flashCmd, 0, sizeof(flashCmd));
        }

        flashCmd.cmdBuf[0] = (pSecRegCfg->exitSecOptCmd << 24);
        flashCmd.rwFlag = SF_CTRL_WRITE;
        SF_Ctrl_SendCmd(&flashCmd);

        timeOut = SFCTRL_BUSY_STATE_TIMEOUT;

        while (SET == SF_Ctrl_GetBusyState()) {
            timeOut--;

            if (timeOut == 0) {
                return TIMEOUT;
            }
        }
    }

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  Read data from flash security register one block
 *
 * @param  pSecRegCfg: Security register configuration pointer
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
BL_Err_Type ATTR_TCM_SECTION SFlash_Read_Security_Register(SFlash_Sec_Reg_Cfg *pSecRegCfg)
{
    uint8_t *const flashCtrlBuf = (uint8_t *)SF_CTRL_BUF_BASE;
    uint32_t curLen, i;
    uint8_t cmd;
    uint8_t secOptMode = 0;
    uint8_t *data = pSecRegCfg->data;
    uint32_t addr = pSecRegCfg->addr;
    uint32_t len = pSecRegCfg->len;
    uint32_t currentAddr = 0;
    uint32_t timeOut = 0;
    SF_Ctrl_Cmd_Cfg_Type flashCmd;

    if (pSecRegCfg->enterSecOptCmd != 0x00) {
        secOptMode = 1;

        if (((uint32_t)(uintptr_t)&flashCmd) % 4 == 0) {
            arch_memset4((uint32_t *)&flashCmd, 0, sizeof(flashCmd) / 4);
        } else {
            arch_memset(&flashCmd, 0, sizeof(flashCmd));
        }

        flashCmd.cmdBuf[0] = (pSecRegCfg->enterSecOptCmd << 24);
        flashCmd.rwFlag = SF_CTRL_WRITE;
        SF_Ctrl_SendCmd(&flashCmd);

        timeOut = SFCTRL_BUSY_STATE_TIMEOUT;

        while (SET == SF_Ctrl_GetBusyState()) {
            timeOut--;

            if (timeOut == 0) {
                return TIMEOUT;
            }
        }
    }

    if (((uint32_t)(uintptr_t)&flashCmd) % 4 == 0) {
        arch_memset4((uint32_t *)&flashCmd, 0, sizeof(flashCmd) / 4);
    } else {
        arch_memset(&flashCmd, 0, sizeof(flashCmd));
    }

    /* Prepare command */
    flashCmd.rwFlag = SF_CTRL_READ;
    flashCmd.addrSize = 3;
    flashCmd.dummyClks = 1;
    cmd = pSecRegCfg->readCmd;

    /* Read data */
    for (i = 0; i < len;) {
        currentAddr = (pSecRegCfg->blockNum << 12) | addr;
        /* Prepare command */
        flashCmd.cmdBuf[0] = (cmd << 24) | (currentAddr);
        curLen = len - i;

        if (curLen >= NOR_FLASH_CTRL_BUF_SIZE) {
            curLen = NOR_FLASH_CTRL_BUF_SIZE;
            flashCmd.nbData = curLen;
        } else {
            /* Make sf_ctrl word read */
            flashCmd.nbData = ((curLen + 3) >> 2) << 2;
        }

        SF_Ctrl_SendCmd(&flashCmd);

        timeOut = SFCTRL_BUSY_STATE_TIMEOUT;

        while (SET == SF_Ctrl_GetBusyState()) {
            timeOut--;

            if (timeOut == 0) {
                return TIMEOUT;
            }
        }

        arch_memcpy_fast(data, flashCtrlBuf, curLen);

        addr += curLen;
        i += curLen;
        data += curLen;
    }

    if (secOptMode > 0) {
        if (((uint32_t)(uintptr_t)&flashCmd) % 4 == 0) {
            arch_memset4((uint32_t *)&flashCmd, 0, sizeof(flashCmd) / 4);
        } else {
            arch_memset(&flashCmd, 0, sizeof(flashCmd));
        }

        flashCmd.cmdBuf[0] = (pSecRegCfg->exitSecOptCmd << 24);
        flashCmd.rwFlag = SF_CTRL_WRITE;
        SF_Ctrl_SendCmd(&flashCmd);

        timeOut = SFCTRL_BUSY_STATE_TIMEOUT;

        while (SET == SF_Ctrl_GetBusyState()) {
            timeOut--;

            if (timeOut == 0) {
                return TIMEOUT;
            }
        }
    }

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  Read data from flash
 *
 * @param  flashCfg: Serial flash parameter configuration pointer
 * @param  ioMode: flash controller interface mode
 * @param  contRead: Wether enable cont read mode
 * @param  addr: flash read start address
 * @param  data: data pointer to store data read from flash
 * @param  len: data length to read
 *
 * @return None
 *
*******************************************************************************/
#ifndef BFLB_USE_ROM_DRIVER
__WEAK
BL_Err_Type ATTR_TCM_SECTION SFlash_Read(SPI_Flash_Cfg_Type *flashCfg,
                                         SF_Ctrl_IO_Type ioMode, uint8_t contRead, uint32_t addr, uint8_t *data, uint32_t len)
{
    uint8_t *const flashCtrlBuf = (uint8_t *)SF_CTRL_BUF_BASE;
    uint32_t curLen, i;
    uint8_t cmd, dummyClks;
    uint32_t timeOut = 0;
    SF_Ctrl_Cmd_Cfg_Type flashCmd;
    uint8_t noReadModeCfg = 0;
    uint8_t cReadSupport = 0;
    uint8_t is32BitsAddr = 0;

    if (((uintptr_t)&flashCmd) % 4 == 0) {
        ARCH_MemSet4((uint32_t *)&flashCmd, 0, sizeof(flashCmd) / 4);
    } else {
        ARCH_MemSet(&flashCmd, 0, sizeof(flashCmd));
    }

    if (SF_CTRL_NIO_MODE == ioMode) {
        cmd = flashCfg->fastReadCmd;
        dummyClks = flashCfg->frDmyClk;
    } else if (SF_CTRL_DO_MODE == ioMode) {
        flashCmd.dataMode = SF_CTRL_DATA_2_LINES;
        cmd = flashCfg->fastReadDoCmd;
        dummyClks = flashCfg->frDoDmyClk;
    } else if (SF_CTRL_DIO_MODE == ioMode) {
        flashCmd.addrMode = SF_CTRL_ADDR_2_LINES;
        flashCmd.dataMode = SF_CTRL_DATA_2_LINES;
        cmd = flashCfg->fastReadDioCmd;
        dummyClks = flashCfg->frDioDmyClk;
    } else if (SF_CTRL_QO_MODE == ioMode) {
        flashCmd.dataMode = SF_CTRL_DATA_4_LINES;
        cmd = flashCfg->fastReadQoCmd;
        dummyClks = flashCfg->frQoDmyClk;
    } else if (SF_CTRL_QIO_MODE == ioMode) {
        flashCmd.addrMode = SF_CTRL_ADDR_4_LINES;
        flashCmd.dataMode = SF_CTRL_DATA_4_LINES;
        cmd = flashCfg->fastReadQioCmd;
        dummyClks = flashCfg->frQioDmyClk;
    } else {
        return ERROR;
    }

    is32BitsAddr = (flashCfg->ioMode & 0x20);
    /* Prepare command */
    flashCmd.rwFlag = SF_CTRL_READ;
    flashCmd.addrSize = 3;

    if (is32BitsAddr > 0) {
        flashCmd.addrSize++;
    }

