ndom91/pinevoice-realtime-firmware/components/chip_bl606p/drivers/soc_std/bsp/std_drv/src/bl606p_sflash.c
    if (SF_CTRL_QIO_MODE == ioMode || SF_CTRL_DIO_MODE == ioMode) {
        noReadModeCfg = flashCfg->cReadSupport & 0x02;
        cReadSupport = flashCfg->cReadSupport & 0x01;

        if (noReadModeCfg == 0) {
            /* Read mode must be set*/
            if (cReadSupport == 0) {
                /* Not support cont read,but we still need set read mode(winbond 80dv)*/
                if (is32BitsAddr > 0) {
                    flashCmd.cmdBuf[1] |= (flashCfg->cReadMode << 16);
                } else {
                    flashCmd.cmdBuf[1] = (flashCfg->cReadMode << 24);
                }
            } else {
                /* Flash support cont read, setting depend on user parameter */
                if (contRead) {
                    if (is32BitsAddr > 0) {
                        flashCmd.cmdBuf[1] |= (flashCfg->cReadMode << 16);
                    } else {
                        flashCmd.cmdBuf[1] = (flashCfg->cReadMode << 24);
                    }
                } else {
                    if (is32BitsAddr > 0) {
                        flashCmd.cmdBuf[1] |= ((!flashCfg->cReadMode) << 16);
                    } else {
                        flashCmd.cmdBuf[1] = ((!flashCfg->cReadMode) << 24);
                    }
                }
            }

            flashCmd.addrSize++;
        }
    }

    flashCmd.dummyClks = dummyClks;

    /* Read data */
    for (i = 0; i < len;) {
        /* Prepare command */
        if (is32BitsAddr > 0) {
            flashCmd.cmdBuf[0] = (cmd << 24) | (addr >> 8);
            flashCmd.cmdBuf[1] |= (addr << 24);
        } else {
            flashCmd.cmdBuf[0] = (cmd << 24) | (addr);
        }

        curLen = len - i;

        if (curLen >= NOR_FLASH_CTRL_BUF_SIZE) {
            curLen = NOR_FLASH_CTRL_BUF_SIZE;
            flashCmd.nbData = curLen;
        } else {
            /* Make sf_ctrl word read */
            flashCmd.nbData = ((curLen + 3) >> 2) << 2;
        }

        SF_Ctrl_SendCmd(&flashCmd);

        timeOut = SFCTRL_BUSY_STATE_TIMEOUT;

        while (SET == SF_Ctrl_GetBusyState()) {
            timeOut--;

            if (timeOut == 0) {
                return TIMEOUT;
            }
        }

        ARCH_MemCpy_Fast(data, flashCtrlBuf, curLen);

        addr += curLen;
        i += curLen;
        data += curLen;
    }

    return SUCCESS;
}
#endif

/****************************************************************************/ /**
 * @brief  Program flash one region
 *
 * @param  flashCfg: Serial flash parameter configuration pointer
 * @param  ioMode: progran mode:SPI mode or QPI mode
 * @param  addr: start address to be programed
 * @param  data: data pointer to be programed
 * @param  len: data length to be programed
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
#ifndef BFLB_USE_ROM_DRIVER
__WEAK
BL_Err_Type ATTR_TCM_SECTION SFlash_Program(SPI_Flash_Cfg_Type *flashCfg,
                                            SF_Ctrl_IO_Type ioMode, uint32_t addr, uint8_t *data, uint32_t len)
{
    uint8_t *const flashCtrlBuf = (uint8_t *)SF_CTRL_BUF_BASE;
    uint32_t i = 0, curLen = 0;
    uint32_t cnt = 0;
    uint8_t is32BitsAddr = 0;
    BL_Err_Type stat;
    uint8_t cmd;
    SF_Ctrl_Cmd_Cfg_Type flashCmd;

    if (((uintptr_t)&flashCmd) % 4 == 0) {
        ARCH_MemSet4((uint32_t *)&flashCmd, 0, sizeof(flashCmd) / 4);
    } else {
        ARCH_MemSet(&flashCmd, 0, sizeof(flashCmd));
    }

    if (SF_CTRL_NIO_MODE == ioMode || SF_CTRL_DO_MODE == ioMode || SF_CTRL_DIO_MODE == ioMode) {
        cmd = flashCfg->pageProgramCmd;
    } else if (SF_CTRL_QIO_MODE == ioMode || SF_CTRL_QO_MODE == ioMode) {
        flashCmd.addrMode = (SF_Ctrl_Addr_Mode_Type)flashCfg->qppAddrMode;
        flashCmd.dataMode = SF_CTRL_DATA_4_LINES;
        cmd = flashCfg->qpageProgramCmd;
    } else {
        return ERROR;
    }

    is32BitsAddr = (flashCfg->ioMode & 0x20);
    /* Prepare command */
    flashCmd.rwFlag = SF_CTRL_WRITE;
    flashCmd.addrSize = 3;

    if (is32BitsAddr > 0) {
        flashCmd.addrSize++;
    }

    for (i = 0; i < len;) {
        /* Write enable is needed for every program */
        stat = SFlash_Write_Enable(flashCfg);

        if (stat != SUCCESS) {
            return stat;
        }

        /* Get current programmed length within page size */
        curLen = flashCfg->pageSize - addr % flashCfg->pageSize;

        if (curLen > len - i) {
            curLen = len - i;
        }

        /* Prepare command */
        ARCH_MemCpy_Fast(flashCtrlBuf, data, curLen);

        if (is32BitsAddr > 0) {
            flashCmd.cmdBuf[0] = (cmd << 24) | (addr >> 8);
            flashCmd.cmdBuf[1] = (addr << 24);
        } else {
            flashCmd.cmdBuf[0] = (cmd << 24) | (addr);
        }

        flashCmd.nbData = curLen;

        SF_Ctrl_SendCmd(&flashCmd);

        /* Adjust address and programmed length */
        addr += curLen;
        i += curLen;
        data += curLen;

        /* Wait for write done */
        cnt = 0;

        while (SET == SFlash_Busy(flashCfg)) {
            arch_delay_us(100);
            cnt++;

            if (cnt > flashCfg->timePagePgm * 20) {
                return ERROR;
            }
        }
    }

    return SUCCESS;
}
#endif

/*@} end of group SFLASH_Public_Functions */

/*@} end of group SFLASH */

/*@} end of group BL606P_Peripheral_Driver */
